faronov/efr32mg1p-zigbee-sensor/app.c
/**
 * @file app.c
 * @brief Application logic for Zigbee BME280 Sensor
 */

#include "sl_component_catalog.h"
#include "zigbee_app_framework_event.h"
#include "app/framework/include/af.h"
#include "app/framework/util/client-api.h"
#include "app/framework/util/util.h"
#ifdef SL_CATALOG_ZIGBEE_NETWORK_STEERING_PRESENT
#include "app/framework/plugin/network-steering/network-steering.h"
#endif
#include "app_profile.h"
#include "app_sensor.h"
#include "app_config.h"
#include "stack/include/network-formation.h"  // For manual network join
#include "stack/include/security.h"
#include "stack/include/binding-table.h"
#include "stack/include/child.h"
#include "hal.h"
#include "sl_sleeptimer.h"
#include "em_cmu.h"
#include "em_gpio.h"
#include "sl_spidrv_instances.h"
#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
#include "sl_power_manager.h"
#endif
#include <stdio.h>
#include <string.h>

// Optional SPIDRV init symbols (generated when SPIDRV component is present).
__attribute__((weak)) void sl_spidrv_exp_init(void);
__attribute__((weak)) void sl_spidrv_init_instances(void);

#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
#include "sl_simple_button_instances.h"
#endif

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
#include "sl_simple_led_instances.h"
#endif

// LED blink event for network joining indication
static sl_zigbee_event_t led_blink_event;
static bool led_blink_active = false;

// LED off timer - turn off LED after network join confirmation
static sl_zigbee_event_t led_off_event;

static uint8_t join_attempt_count = 0;
#define JOIN_SCAN_DURATION 3  // Active scan duration (Zigbee scan exponent)

// Button action flags (set by ISR, cleared by main loop)
// Using volatile because these are accessed from both ISR and main context
static volatile bool button_short_press_pending = false;
static volatile bool button_long_press_pending = false;

// Button press duration tracking
static uint32_t button_press_start_tick = 0;
static bool button_pressed = false;
#define BUTTON_DEBOUNCE_MS 80
#ifndef APP_BUTTON_LONG_PRESS_MS
#define APP_BUTTON_LONG_PRESS_MS 5000  // default: 5 seconds for long press
#endif

// Optimized rejoin state machine (TEMPORARILY DISABLED - event queue issue)
// typedef enum {
//   REJOIN_STATE_IDLE,
//   REJOIN_STATE_CURRENT_CHANNEL,
//   REJOIN_STATE_ALL_CHANNELS,
//   REJOIN_STATE_DONE
// } RejoinState_t;

// static sl_zigbee_event_t rejoin_retry_event;
// static RejoinState_t rejoin_state = REJOIN_STATE_IDLE;
// static uint8_t saved_channel = 0;

// Rejoin timeout configuration
#define REJOIN_CURRENT_CHANNEL_TIMEOUT_MS  500   // Wait 500ms before trying all channels
#define REJOIN_FULL_SCAN_TIMEOUT_MS        5000  // Wait 5s for full scan to complete

// Channel mask helper macro
#ifndef BIT32
#define BIT32(n) (((uint32_t)1) << (n))
#endif

#if defined(__GNUC__)
#define APP_UNUSED __attribute__((unused))
#else
#define APP_UNUSED
#endif

#ifndef APP_DEBUG_DIAG_ALWAYS
#define APP_DEBUG_DIAG_ALWAYS 0
#endif
#ifndef APP_DEBUG_SPI_ONLY
#define APP_DEBUG_SPI_ONLY 0
#endif
#ifndef APP_DEBUG_RESET_NETWORK
#define APP_DEBUG_RESET_NETWORK 0
#endif
#ifndef APP_DEBUG_AWAKE_AFTER_JOIN_MS
#define APP_DEBUG_AWAKE_AFTER_JOIN_MS 0
#endif
#ifndef APP_DEBUG_FAST_POLL_AFTER_JOIN_MS
#define APP_DEBUG_FAST_POLL_AFTER_JOIN_MS 0
#endif
#ifndef APP_DEBUG_FAST_POLL_INTERVAL_MS
#define APP_DEBUG_FAST_POLL_INTERVAL_MS 250
#endif
#ifndef APP_DEBUG_MANUAL_POLL_BOOST_MS
#define APP_DEBUG_MANUAL_POLL_BOOST_MS 60000
#endif
#ifndef APP_DEBUG_MANUAL_POLL_INTERVAL_MS
#define APP_DEBUG_MANUAL_POLL_INTERVAL_MS 250
#endif
#ifndef APP_DEBUG_BUTTON_GUARD_AFTER_JOIN_MS
#define APP_DEBUG_BUTTON_GUARD_AFTER_JOIN_MS 30000
#endif
#ifndef APP_DEBUG_BUTTON_GUARD_AFTER_BOOT_MS
#define APP_DEBUG_BUTTON_GUARD_AFTER_BOOT_MS 1500
#endif
#ifndef APP_DEBUG_BUTTON_GUARD_AFTER_LEAVE_MS
#define APP_DEBUG_BUTTON_GUARD_AFTER_LEAVE_MS 5000
#endif
#ifndef APP_DEBUG_JOIN_RETRY_BACKOFF_MS
#define APP_DEBUG_JOIN_RETRY_BACKOFF_MS 2000
#endif
#ifndef APP_DEBUG_JOIN_RETRY_BACKOFF_AFTER_LEAVE_MS
#define APP_DEBUG_JOIN_RETRY_BACKOFF_AFTER_LEAVE_MS 800
#endif
#ifndef APP_DEBUG_BUTTON_MAX_VALID_PRESS_MS
#define APP_DEBUG_BUTTON_MAX_VALID_PRESS_MS 30000
#endif
#ifndef APP_DEBUG_POLL_SIMPLE_BUTTON_INSTANCES
#define APP_DEBUG_POLL_SIMPLE_BUTTON_INSTANCES 0
#endif
#ifndef APP_DEBUG_AUTO_JOIN_ON_BOOT
#define APP_DEBUG_AUTO_JOIN_ON_BOOT 1
#endif
#ifndef APP_DEBUG_AUTO_JOIN_ON_PIN_RESET
#define APP_DEBUG_AUTO_JOIN_ON_PIN_RESET 0
#endif
#ifndef APP_DEBUG_AUTO_JOIN_DELAY_MS
#define APP_DEBUG_AUTO_JOIN_DELAY_MS 5000
#endif
#ifndef APP_DEBUG_JOIN_AS_END_DEVICE
#define APP_DEBUG_JOIN_AS_END_DEVICE 0
#endif
#ifndef APP_DEBUG_SET_KEEPALIVE_ALL
#define APP_DEBUG_SET_KEEPALIVE_ALL 0
#endif
#ifndef APP_DEBUG_NO_SLEEP
#define APP_DEBUG_NO_SLEEP 0
#endif
#ifndef APP_DEBUG_USE_NETWORK_STEERING
#define APP_DEBUG_USE_NETWORK_STEERING 1
#endif
#define APP_DEBUG_PRINTF(...) printf(__VA_ARGS__)

#if defined(SL_CATALOG_ZIGBEE_NETWORK_STEERING_PRESENT) && (APP_DEBUG_USE_NETWORK_STEERING != 0)
#define APP_RUNTIME_NETWORK_STEERING 1
#else
#define APP_RUNTIME_NETWORK_STEERING 0
#endif

static void handle_short_press(void);
static void handle_long_press(void);

void app_debug_sanity(void)
{
  APP_DEBUG_PRINTF("app_debug_sanity\n");
#if APP_DEBUG_DIAG_ALWAYS
  uint8_t endpoint_count = emberAfEndpointCount();
  APP_DEBUG_PRINTF("Debug: endpoint count=%u primary=%u\n",
                   endpoint_count,
                   emberAfPrimaryEndpoint());
  bool ota_client_present = false;
  for (uint8_t i = 0; i < endpoint_count; i++) {
    uint8_t ep = emberAfEndpointFromIndex(i);
    bool has_ota = emberAfContainsClient(ep, ZCL_OTA_BOOTLOAD_CLUSTER_ID);
    if (has_ota) {
      ota_client_present = true;
    }
    APP_DEBUG_PRINTF("Debug: ep %u ota_client=%u\n", ep, has_ota ? 1 : 0);
  }
  if (!ota_client_present) {
    APP_DEBUG_PRINTF("Debug: OTA client cluster missing - expect ep FF writes\n");
  }
#endif
}

void app_debug_trigger_short_press(void)
{
  APP_DEBUG_PRINTF("app_debug_trigger_short_press\n");
  handle_short_press();
}

