faronov/efr32mg1p-zigbee-sensor/app.c
void app_debug_trigger_long_press(void)
{
  APP_DEBUG_PRINTF("app_debug_trigger_long_press\n");
  handle_long_press();
}

// Zigbee 3.0 channels (11-26)
#define ZIGBEE_CHANNELS_MASK 0x07FFF800

// Single-channel network join state (Series 1 workaround for event queue limitation)
// Try channels in order of popularity: 15, 20, 25, 11, 14, 19, 24, 26, 12, 13, 16, 17, 18, 21, 22, 23
static const uint8_t channel_scan_order[] = {15, 20, 25, 11, 14, 19, 24, 26, 12, 13, 16, 17, 18, 21, 22, 23};
static uint8_t current_channel_index = 0;  // Index into channel_scan_order array
static bool network_join_in_progress = false;
static bool join_scan_in_progress = false;
static bool join_network_found = false;
static bool app_intentional_leave_pending = false;
static EmberZigbeeNetwork join_candidate;
static bool af_init_seen = false;
static bool af_init_reported = false;
static bool basic_identity_pending = false;
static bool af_init_force_pending = false;
static uint32_t af_init_force_tick = 0;
static uint32_t basic_identity_tick = 0;
#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && (APP_DEBUG_AWAKE_AFTER_JOIN_MS > 0)
static bool app_join_awake_active = false;
static uint32_t app_join_awake_start_tick = 0;
#endif
#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
static bool app_fast_poll_active = false;
static uint32_t app_fast_poll_start_tick = 0;
#endif
static bool app_manual_poll_boost_active = false;
static uint32_t app_manual_poll_boost_start_tick = 0;
static uint32_t app_manual_poll_boost_last_tick = 0;
static uint32_t app_button_unlock_tick = 0;
static uint32_t app_leave_unlock_tick = 0;
static uint32_t app_join_retry_unlock_tick = 0;
static bool app_auto_join_scheduled = false;
static uint32_t app_auto_join_tick = 0;
#if APP_DEBUG_RESET_NETWORK
static bool debug_reset_network_done = false;
#endif

void app_debug_poll(void);
bool app_debug_button_ready(void);
static bool join_pending = false;
static bool join_security_configured = false;

#ifndef EMBER_ENCRYPTION_KEY_SIZE
#define EMBER_ENCRYPTION_KEY_SIZE 16
#endif

static const uint8_t zigbee_alliance_key[EMBER_ENCRYPTION_KEY_SIZE] = {
  0x5A, 0x69, 0x67, 0x42, 0x65, 0x65, 0x41, 0x6C,
  0x6C, 0x69, 0x61, 0x6E, 0x63, 0x65, 0x30, 0x39
};

// Forward declarations
static void led_blink_event_handler(sl_zigbee_event_t *event);
static void led_off_event_handler(sl_zigbee_event_t *event);
static void rejoin_retry_event_handler(sl_zigbee_event_t *event) APP_UNUSED;
static void start_optimized_rejoin(void) APP_UNUSED;
static void handle_short_press(void);
static void handle_long_press(void);
static EmberStatus start_join_scan(void);
static void try_next_channel(void);
static bool configure_join_security(void);
static bool log_basic_identity(void);
static void app_flash_probe(void);
static void app_flash_enable_init(void);
static void app_flash_send_cmd(GPIO_Port_TypeDef port,
                               unsigned int pin,
                               uint8_t cmd);
static bool app_flash_probe_with_cs(GPIO_Port_TypeDef port,
                                    unsigned int pin,
                                    const char *label);
static void app_init_once(void);
static bool app_handle_basic_mfg_rw_command(const EmberAfClusterCommand *cmd);
#if APP_DEBUG_RESET_NETWORK
static void app_debug_reset_network_state(void);
#endif

static bool app_join_retry_blocked(uint32_t now)
{
  if (app_join_retry_unlock_tick == 0) {
    return false;
  }
  if ((int32_t)(app_join_retry_unlock_tick - now) <= 0) {
    app_join_retry_unlock_tick = 0;
    return false;
  }
  return true;
}

static bool app_leave_guard_active(uint32_t now)
{
  if (app_leave_unlock_tick == 0) {
    return false;
  }
  if ((int32_t)(app_leave_unlock_tick - now) <= 0) {
    app_leave_unlock_tick = 0;
    return false;
  }
  return true;
}

static void app_set_join_retry_backoff(uint32_t now, uint32_t delay_ms)
{
  app_join_retry_unlock_tick = now + sl_sleeptimer_ms_to_tick(delay_ms);
}

#if APP_RUNTIME_NETWORK_STEERING
void emberAfPluginNetworkSteeringCompleteCallback(EmberStatus status,
                                                  uint8_t totalBeacons,
                                                  uint8_t joinAttempts,
                                                  uint8_t finalState)
{
  APP_DEBUG_PRINTF("Join: steering complete status=0x%02x beacons=%u attempts=%u state=%u\n",
                   status,
                   totalBeacons,
                   joinAttempts,
                   finalState);

  // If stack is still down after steering completion, allow a new button-triggered join attempt.
  if (emberAfNetworkState() != EMBER_JOINED_NETWORK) {
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;
  }
}
#endif

/**
 * @brief Zigbee application init callback
 *
 * Called when the Zigbee stack has completed initialization.
 * This is where we initialize application components.
 */
static void app_init_once(void)
{
  uint32_t now = sl_sleeptimer_get_tick_count();
#if APP_DEBUG_SPI_ONLY
  APP_DEBUG_PRINTF("SPI-only debug mode\n");
  app_flash_probe();
  return;
#endif
  if (af_init_seen) {
    APP_DEBUG_PRINTF("AF init callback (duplicate)\n");
    return;
  }
  APP_DEBUG_PRINTF("AF init callback\n");
  af_init_seen = true;
  af_init_force_pending = false;
  af_init_force_tick = 0;

#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
  // TRADFRI boards may not have an external pull-up on BTN0 (PB13).
  // Force internal pull-up + input filter to avoid floating/false presses.
  GPIO_PinModeSet(gpioPortB, 13, gpioModeInputPullFilter, 1);
  APP_DEBUG_PRINTF("BTN0: internal pull-up enabled (PB13)\n");
  // Re-arm simple_button after direct GPIO reconfiguration above.
  sl_button_disable(&sl_button_btn0);
  sl_button_enable(&sl_button_btn0);

  // Drop any stale press state captured before AF init was complete.
  // This avoids false "long press" on the first post-boot release edge.
  button_short_press_pending = false;
  button_long_press_pending = false;
  button_pressed = false;
  button_press_start_tick = 0;
  app_button_unlock_tick = now + sl_sleeptimer_ms_to_tick(APP_DEBUG_BUTTON_GUARD_AFTER_BOOT_MS);
  APP_DEBUG_PRINTF("Button guard: ignoring BTN0 for %lu ms after init\n",
                   (unsigned long)APP_DEBUG_BUTTON_GUARD_AFTER_BOOT_MS);

#endif

