faronov/efr32mg1p-zigbee-sensor/app.c
#if APP_DEBUG_RESET_NETWORK
  app_debug_reset_network_state();
#endif
  emberAfCorePrintln("Zigbee BME280 Sensor Application");
  emberAfCorePrintln("Silicon Labs EFR32MG1P + Bosch BME280");
  emberAfCorePrintln("Press BTN0 to join network or trigger sensor reading");

  // Initialize LED events
  sl_zigbee_event_init(&led_blink_event, led_blink_event_handler);
  sl_zigbee_event_init(&led_off_event, led_off_event_handler);

  // Button handling uses emberAfTickCallback() to check flags - no events needed

  // Initialize optimized rejoin event (TEMPORARILY DISABLED - event queue issue)
  // sl_zigbee_event_init(&rejoin_retry_event, rejoin_retry_event_handler);

  // Initialize configuration from NVM
  app_config_init();
  if (!log_basic_identity()) {
    basic_identity_pending = true;
  }

#if APP_DEBUG_DIAG_ALWAYS
  app_flash_probe();
#endif

  // Initialize BME280 sensor
  if (!app_sensor_init()) {
    emberAfCorePrintln("ERROR: Sensor initialization failed!");
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Rapid blink on error
    for (int i = 0; i < 10; i++) {
      sl_led_toggle(&sl_led_led0);
      sl_sleeptimer_delay_millisecond(100);
    }
#endif
  }

#if APP_DEBUG_AUTO_JOIN_ON_BOOT
  if (emberAfNetworkState() != EMBER_JOINED_NETWORK && !network_join_in_progress) {
    uint32_t now = sl_sleeptimer_get_tick_count();
    app_auto_join_scheduled = true;
    app_auto_join_tick = now + sl_sleeptimer_ms_to_tick(APP_DEBUG_AUTO_JOIN_DELAY_MS);
    APP_DEBUG_PRINTF("Debug: auto-join scheduled in %lu ms\n",
                     (unsigned long)APP_DEBUG_AUTO_JOIN_DELAY_MS);
  }
#endif

#if APP_DEBUG_AUTO_JOIN_ON_PIN_RESET
  // TRADFRI button can be wired to reset line on some hardware revisions.
  // If boot reason is external pin reset, treat it as an implicit join request.
  if (halGetResetInfo() == 0x03u) {
    APP_DEBUG_PRINTF("Debug: auto-join after pin reset\n");
    handle_short_press();
  }
#endif
}

void emberAfMainInitCallback(void)
{
  app_init_once();
}

#if APP_DEBUG_RESET_NETWORK
static void app_debug_reset_network_state(void)
{
  if (debug_reset_network_done) {
    return;
  }
  debug_reset_network_done = true;
  emberAfCorePrintln("Debug: resetting network state");
  EmberStatus leave_status = emberLeaveNetwork();
  emberAfCorePrintln("Debug: leave network -> 0x%02X", leave_status);
  EmberStatus bind_status = emberClearBindingTable();
  emberAfCorePrintln("Debug: clear binding table -> 0x%02X", bind_status);
  EmberStatus key_status = emberClearKeyTable();
  emberAfCorePrintln("Debug: clear key table -> 0x%02X", key_status);
  join_attempt_count = 0;
  current_channel_index = 0;
  join_scan_in_progress = false;
  join_network_found = false;
  network_join_in_progress = false;
}
#endif

void app_debug_force_af_init(void)
{
#if defined(APP_DEBUG_FORCE_AF_INIT) && (APP_DEBUG_FORCE_AF_INIT != 0)
  if (!af_init_seen) {
    APP_DEBUG_PRINTF("AF init requested (debug)\n");
    af_init_force_pending = true;
  }
#endif
}

void app_debug_poll(void)
{
  static uint32_t sensor_watchdog_last_tick = 0;
  uint32_t now = sl_sleeptimer_get_tick_count();
  uint32_t now_ms = sl_sleeptimer_tick_to_ms(now);
  bool button_guard_active = (app_button_unlock_tick != 0)
                             && ((int32_t)(app_button_unlock_tick - now) > 0);
  bool leave_guard_active = app_leave_guard_active(now);
  if (leave_guard_active) {
    button_guard_active = true;
  }

  // Hard gate: while joining, ignore all button activity completely.
  if (network_join_in_progress) {
    button_short_press_pending = false;
    button_long_press_pending = false;
    button_pressed = false;
    button_press_start_tick = 0;
  }
  if (leave_guard_active) {
    button_short_press_pending = false;
    button_long_press_pending = false;
    button_pressed = false;
    button_press_start_tick = 0;
  }

  if (!af_init_reported && af_init_seen) {
    af_init_reported = true;
    APP_DEBUG_PRINTF("AF init seen (tick)\n");
  }

  if (af_init_force_pending && !af_init_seen) {
    if (af_init_force_tick == 0) {
      af_init_force_tick = now;
    } else if (sl_sleeptimer_tick_to_ms(now - af_init_force_tick) >= 2000) {
      APP_DEBUG_PRINTF("AF init timeout - fallback callback\n");
      app_init_once();
      af_init_force_pending = false;
    }
  }

#if defined(SL_CATALOG_SIMPLE_BUTTON_PRESENT) && (APP_DEBUG_POLL_SIMPLE_BUTTON_INSTANCES != 0)
  // Keep simple_button state machine updated even if AF tick callback isn't
  // scheduled frequently on this target.
  sl_simple_button_poll_instances();
#endif

  // Some debug builds run without AF tick wiring, so process deferred joins here.
  if (join_pending && af_init_seen && !network_join_in_progress) {
    join_pending = false;
    APP_DEBUG_PRINTF("Join: deferred request starting (poll)\n");
    handle_short_press();
  }

  if (app_auto_join_scheduled) {
    EmberNetworkStatus state = emberAfNetworkState();
    if (state == EMBER_JOINED_NETWORK || network_join_in_progress) {
      app_auto_join_scheduled = false;
      app_auto_join_tick = 0;
    } else if (af_init_seen
               && app_auto_join_tick != 0
               && (int32_t)(now - app_auto_join_tick) >= 0) {
      app_auto_join_scheduled = false;
      app_auto_join_tick = 0;
      APP_DEBUG_PRINTF("Debug: auto-join timer fired\n");
      handle_short_press();
    }
  }

  // Self-heal: if joined and periodic sensor updates stall, re-arm them.
  if (emberAfNetworkState() == EMBER_JOINED_NETWORK) {
    if (sensor_watchdog_last_tick == 0
        || sl_sleeptimer_tick_to_ms(now - sensor_watchdog_last_tick) >= 5000) {
      sensor_watchdog_last_tick = now;
      uint32_t last_update_ms = app_sensor_get_last_update_ms();
      bool timer_running = app_sensor_is_timer_running();
      if (!timer_running
          || (last_update_ms != 0 && (now_ms - last_update_ms) > 45000)) {
        APP_DEBUG_PRINTF("Sensor watchdog: restart periodic updates (timer=%d last_age=%lu ms)\n",
                         timer_running ? 1 : 0,
                         (unsigned long)(last_update_ms == 0 ? 0 : (now_ms - last_update_ms)));
        app_sensor_start_periodic_updates();
      }
    }
  }

  // Some targets do not run emberAfTickCallback reliably in this app flow.
  // Consume button flags here as well to guarantee action dispatch.
  if (button_short_press_pending) {
    button_short_press_pending = false;
    if (button_guard_active) {
      APP_DEBUG_PRINTF("Button guard: short press ignored\n");
    } else {
      APP_DEBUG_PRINTF("Button short press\n");
      emberAfCorePrintln("Button: Short press detected (poll callback)");
      handle_short_press();
    }
  }

  if (button_long_press_pending) {
    button_long_press_pending = false;
    if (button_guard_active) {
      APP_DEBUG_PRINTF("Button guard: long press ignored\n");
    } else {
      APP_DEBUG_PRINTF("Button long press\n");
      emberAfCorePrintln("Button: Long press detected (poll callback)");
      handle_long_press();
    }
  }
  if (basic_identity_pending && af_init_seen) {
    if (basic_identity_tick == 0 ||
        sl_sleeptimer_tick_to_ms(now - basic_identity_tick) >= 2000) {
      basic_identity_tick = now;
      if (log_basic_identity()) {
        basic_identity_pending = false;
      }
    }
  }
#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && (APP_DEBUG_AWAKE_AFTER_JOIN_MS > 0)
  if (app_join_awake_active && app_join_awake_start_tick != 0) {
    uint32_t elapsed_ms = sl_sleeptimer_tick_to_ms(now - app_join_awake_start_tick);
    if (elapsed_ms >= APP_DEBUG_AWAKE_AFTER_JOIN_MS) {
      sl_power_manager_remove_em_requirement(SL_POWER_MANAGER_EM0);
      app_join_awake_active = false;
      app_join_awake_start_tick = 0;
      APP_DEBUG_PRINTF("Debug: post-join awake window ended\n");
    }
  }
#endif

