faronov/efr32mg1p-zigbee-sensor/app.c
#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
  if (app_fast_poll_active && app_fast_poll_start_tick != 0) {
    uint32_t elapsed_ms = sl_sleeptimer_tick_to_ms(now - app_fast_poll_start_tick);
    if (elapsed_ms >= APP_DEBUG_FAST_POLL_AFTER_JOIN_MS) {
#if (APP_DEBUG_NO_SLEEP != 0)
      // In no-sleep debug mode keep short-poll/app-tasks active after the
      // "window" so SWO remains alive and SED stays responsive for diagnostics.
      APP_DEBUG_PRINTF("Debug: fast poll window ended (no-sleep mode, keeping short poll)\n");
#else
      // Keep parent-connectivity short-poll task active after join window.
      // Fully dropping to long-poll caused SEDs to go quiet on some coordinators.
      emberAfSetDefaultPollControlCallback(EMBER_AF_SHORT_POLL);
      emberAfRemoveFromCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL);
      emberAfSetDefaultSleepControl(EMBER_AF_OK_TO_SLEEP);
      APP_DEBUG_PRINTF("Debug: fast poll window ended (keeping parent connectivity short poll)\n");
#endif
      app_fast_poll_active = false;
      app_fast_poll_start_tick = 0;
    }
  }
#endif

#if (APP_DEBUG_MANUAL_POLL_BOOST_MS > 0)
  if (app_manual_poll_boost_active) {
    if (emberAfNetworkState() != EMBER_JOINED_NETWORK) {
      app_manual_poll_boost_active = false;
      app_manual_poll_boost_start_tick = 0;
      app_manual_poll_boost_last_tick = 0;
    } else {
      uint32_t elapsed_ms = sl_sleeptimer_tick_to_ms(now - app_manual_poll_boost_start_tick);
      if (elapsed_ms >= APP_DEBUG_MANUAL_POLL_BOOST_MS) {
        app_manual_poll_boost_active = false;
        app_manual_poll_boost_start_tick = 0;
        app_manual_poll_boost_last_tick = 0;
        APP_DEBUG_PRINTF("Debug: manual poll boost window ended\n");
      } else if (app_manual_poll_boost_last_tick == 0
                 || sl_sleeptimer_tick_to_ms(now - app_manual_poll_boost_last_tick)
                 >= APP_DEBUG_MANUAL_POLL_INTERVAL_MS) {
        app_manual_poll_boost_last_tick = now;
        EmberStatus poll_st = emberPollForData();
        if (poll_st != EMBER_SUCCESS && poll_st != EMBER_MAC_SCANNING) {
          APP_DEBUG_PRINTF("Debug: manual poll -> 0x%02x\n", poll_st);
        }
      }
    }
  }
#endif
}

bool app_debug_button_ready(void)
{
  return af_init_seen;
}

static bool log_basic_identity(void)
{
  uint8_t buf[1 + 32];
  char str[33];
  EmberAfStatus st;
  uint8_t endpoint_count = emberAfEndpointCount();
  if (endpoint_count == 0) {
    APP_DEBUG_PRINTF("Basic: endpoints not ready (count=0)\n");
    return false;
  }
  uint8_t endpoint = emberAfEndpointFromIndex(0);
  APP_DEBUG_PRINTF("Basic: using endpoint %u (count=%u)\n",
                   endpoint,
                   endpoint_count);

#ifdef ZCL_POWER_SOURCE_ATTRIBUTE_ID
  {
    uint8_t power_source = 0x03; // Battery
    EmberAfStatus wr = emberAfWriteServerAttribute(endpoint,
                                                    ZCL_BASIC_CLUSTER_ID,
                                                    ZCL_POWER_SOURCE_ATTRIBUTE_ID,
                                                    &power_source,
                                                    ZCL_ENUM8_ATTRIBUTE_TYPE);
    APP_DEBUG_PRINTF("Basic: set power source(battery) -> 0x%02x\n", wr);
  }
#endif

#ifdef ZCL_MANUFACTURER_NAME_ATTRIBUTE_ID
  st = emberAfReadServerAttribute(endpoint,
                                  ZCL_BASIC_CLUSTER_ID,
                                  ZCL_MANUFACTURER_NAME_ATTRIBUTE_ID,
                                  buf,
                                  sizeof(buf));
  if (st == EMBER_ZCL_STATUS_SUCCESS) {
    uint8_t len = buf[0] > 32 ? 32 : buf[0];
    memcpy(str, &buf[1], len);
    str[len] = '\0';
    APP_DEBUG_PRINTF("Basic: manufacturer=\"%s\"\n", str);
  } else {
    APP_DEBUG_PRINTF("Basic: manufacturer read -> 0x%02x\n", st);
  }
#endif

#ifdef ZCL_MODEL_IDENTIFIER_ATTRIBUTE_ID
  st = emberAfReadServerAttribute(endpoint,
                                  ZCL_BASIC_CLUSTER_ID,
                                  ZCL_MODEL_IDENTIFIER_ATTRIBUTE_ID,
                                  buf,
                                  sizeof(buf));
  if (st == EMBER_ZCL_STATUS_SUCCESS) {
    uint8_t len = buf[0] > 32 ? 32 : buf[0];
    memcpy(str, &buf[1], len);
    str[len] = '\0';
    APP_DEBUG_PRINTF("Basic: model=\"%s\"\n", str);
  } else {
    APP_DEBUG_PRINTF("Basic: model read -> 0x%02x\n", st);
  }
#endif

#ifdef ZCL_SW_BUILD_ID_ATTRIBUTE_ID
  st = emberAfReadServerAttribute(endpoint,
                                  ZCL_BASIC_CLUSTER_ID,
                                  ZCL_SW_BUILD_ID_ATTRIBUTE_ID,
                                  buf,
                                  sizeof(buf));
  if (st == EMBER_ZCL_STATUS_SUCCESS) {
    uint8_t len = buf[0] > 32 ? 32 : buf[0];
    memcpy(str, &buf[1], len);
    str[len] = '\0';
    APP_DEBUG_PRINTF("Basic: sw build=\"%s\"\n", str);
  } else {
    APP_DEBUG_PRINTF("Basic: sw build read -> 0x%02x\n", st);
  }
#endif
  return true;
}

static void app_flash_probe(void)
{
  app_flash_enable_init();

  static bool spidrv_inited = false;
  if (!spidrv_inited) {
    if (sl_spidrv_exp_init != NULL) {
      sl_spidrv_exp_init();
    } else if (sl_spidrv_init_instances != NULL) {
      sl_spidrv_init_instances();
    } else {
      APP_DEBUG_PRINTF("SPI flash: SPIDRV init symbol missing\n");
    }
    spidrv_inited = true;
    APP_DEBUG_PRINTF("SPI flash: SPIDRV exp init (handle=%p)\n",
                     (void *)sl_spidrv_exp_handle);
#ifdef SL_SPIDRV_EXP_PERIPHERAL
    USART_TypeDef *periph = SL_SPIDRV_EXP_PERIPHERAL;
    const char *periph_name = "USART?";
    if (periph == USART0) {
      periph_name = "USART0";
    } else if (periph == USART1) {
      periph_name = "USART1";
    }
    APP_DEBUG_PRINTF("SPI flash: %s ROUTELOC0=0x%08lX ROUTEPEN=0x%08lX\n",
                     periph_name,
                     (unsigned long)periph->ROUTELOC0,
                     (unsigned long)periph->ROUTEPEN);
#endif
#ifdef SL_SPIDRV_EXP_TX_LOC
    APP_DEBUG_PRINTF("SPI flash: SPIDRV loc tx=%u rx=%u clk=%u\n",
                     (unsigned)SL_SPIDRV_EXP_TX_LOC,
                     (unsigned)SL_SPIDRV_EXP_RX_LOC,
                     (unsigned)SL_SPIDRV_EXP_CLK_LOC);
#endif
  }

  if (!app_flash_probe_with_cs(gpioPortB, 11, "PB11")) {
    APP_DEBUG_PRINTF("SPI flash: no response on PB11\n");
  }
}

static void app_flash_enable_init(void)
{
  static bool configured = false;
  if (configured) {
    return;
  }
  // ICC-1 exposes PF3; ICC-A-1 uses PF3 internally to enable the SPI flash.
  GPIO_PinModeSet(gpioPortF, 3, gpioModePushPull, 1);
  APP_DEBUG_PRINTF("SPI flash: enable PF3=1\n");
  configured = true;
}

