faronov/efr32mg1p-zigbee-sensor/app.c
    // Avoid heavy sensor transactions right at join/interview start.
    // Start periodic updates and let first sample happen on timer.
    app_sensor_start_periodic_updates();

    // Note: Binding is handled by coordinator (Zigbee2MQTT/ZHA/deCONZ)
    // No device-side binding code needed - see BINDING_GUIDE.md

  } else if (status == EMBER_NETWORK_DOWN) {
    if (app_intentional_leave_pending) {
      emberAfCorePrintln("Network down after manual leave");
      app_intentional_leave_pending = false;
      app_leave_unlock_tick = now + sl_sleeptimer_ms_to_tick(APP_DEBUG_BUTTON_GUARD_AFTER_LEAVE_MS);
      app_set_join_retry_backoff(now, APP_DEBUG_BUTTON_GUARD_AFTER_LEAVE_MS);
      APP_DEBUG_PRINTF("Button guard: ignoring BTN0 for %lu ms after leave\n",
                       (unsigned long)APP_DEBUG_BUTTON_GUARD_AFTER_LEAVE_MS);
    } else {
      emberAfCorePrintln("Network down - will attempt optimized rejoin");
      app_set_join_retry_backoff(now, APP_DEBUG_JOIN_RETRY_BACKOFF_AFTER_LEAVE_MS);
    }
    app_button_unlock_tick = 0;
    join_security_configured = false;

#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
    emberAfSetDefaultPollControlCallback(EMBER_AF_LONG_POLL);
    emberAfRemoveFromCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL);
    emberAfRemoveFromCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL_FOR_PARENT_CONNECTIVITY);
    emberAfSetDefaultSleepControl(EMBER_AF_OK_TO_SLEEP);
    app_fast_poll_active = false;
    app_fast_poll_start_tick = 0;
#endif

    app_manual_poll_boost_active = false;
    app_manual_poll_boost_start_tick = 0;
    app_manual_poll_boost_last_tick = 0;

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED off when network is down
    sl_led_turn_off(&sl_led_led0);
    // Cancel any pending LED off event
    sl_zigbee_event_set_inactive(&led_off_event);
#endif

    // Stop periodic sensor timer while network is down to avoid 10s wakeups.
    app_sensor_stop_periodic_updates();

    // Optimized rejoin TEMPORARILY DISABLED - event queue issue
    // emberAfCorePrintln("Scheduling optimized rejoin in 100ms...");
    // rejoin_state = REJOIN_STATE_IDLE;
    // sl_zigbee_event_set_delay_ms(&rejoin_retry_event, 100);

  }
}

void emberAfPluginEndDeviceSupportPollCompletedCallback(EmberStatus status)
{
  // Avoid log spam on normal idle polls.
  if (status != EMBER_MAC_NO_DATA) {
    APP_DEBUG_PRINTF("Poll complete: status=0x%02x\n", status);
  }
}

static bool app_handle_basic_mfg_rw_command(const EmberAfClusterCommand *cmd)
{
  if (cmd == NULL || cmd->apsFrame == NULL) {
    return false;
  }

  if (!cmd->mfgSpecific
      || cmd->mfgCode != APP_MANUFACTURER_CODE
      || cmd->apsFrame->clusterId != ZCL_BASIC_CLUSTER_ID) {
    return false;
  }

  // Manufacturer-specific global command frame: global + mfg + server->client
  const uint8_t mfg_global_response_fc =
    (uint8_t)(ZCL_GLOBAL_COMMAND
              | ZCL_MANUFACTURER_SPECIFIC_MASK
              | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT);

  if (cmd->commandId == ZCL_READ_ATTRIBUTES_COMMAND_ID) {
    // Header for mfg-specific command: FC(1), MFG(2), SEQ(1), CMD(1)
    uint16_t i = 5;
    (void)emberAfFillExternalManufacturerSpecificBuffer(mfg_global_response_fc,
                                                         ZCL_BASIC_CLUSTER_ID,
                                                         APP_MANUFACTURER_CODE,
                                                         ZCL_READ_ATTRIBUTES_RESPONSE_COMMAND_ID,
                                                         "");

    while ((i + 1u) < cmd->bufLen) {
      EmberAfAttributeId attribute_id =
        (EmberAfAttributeId)(cmd->buffer[i] | ((uint16_t)cmd->buffer[i + 1] << 8));
      i += 2;

      uint8_t attr_type = 0;
      uint8_t value[8];
      uint8_t value_len = (uint8_t)sizeof(value);
      EmberAfStatus st = app_config_read_mfg_attribute(attribute_id,
                                                       &attr_type,
                                                       value,
                                                       &value_len);

      (void)emberAfPutInt16uInResp(attribute_id);
      (void)emberAfPutInt8uInResp((uint8_t)st);
      if (st == EMBER_ZCL_STATUS_SUCCESS) {
        (void)emberAfPutInt8uInResp(attr_type);
        if (value_len > 0) {
          (void)emberAfAppendToExternalBuffer(value, value_len);
        }
      }
    }

    EmberStatus send_st = emberAfSendResponse();
    if (send_st != EMBER_SUCCESS) {
      APP_DEBUG_PRINTF("MFG READ response send failed: 0x%02x\n", send_st);
    }
    return true;
  }

  if (cmd->commandId == ZCL_WRITE_ATTRIBUTES_COMMAND_ID) {
    // Header for mfg-specific command: FC(1), MFG(2), SEQ(1), CMD(1)
    uint16_t i = 5;
    bool all_success = true;
    (void)emberAfFillExternalManufacturerSpecificBuffer(mfg_global_response_fc,
                                                         ZCL_BASIC_CLUSTER_ID,
                                                         APP_MANUFACTURER_CODE,
                                                         ZCL_WRITE_ATTRIBUTES_RESPONSE_COMMAND_ID,
                                                         "");

    while ((i + 3u) < cmd->bufLen) {
      EmberAfAttributeId attribute_id =
        (EmberAfAttributeId)(cmd->buffer[i] | ((uint16_t)cmd->buffer[i + 1] << 8));
      i += 2;
      uint8_t attr_type = cmd->buffer[i++];
      uint8_t data_len = emberAfGetDataSize(attr_type);
      if ((i + data_len) > cmd->bufLen) {
        // Malformed payload
        all_success = false;
        (void)emberAfPutInt8uInResp((uint8_t)EMBER_ZCL_STATUS_MALFORMED_COMMAND);
        (void)emberAfPutInt16uInResp(attribute_id);
        break;
      }

      EmberAfStatus st = app_config_write_mfg_attribute(attribute_id,
                                                        attr_type,
                                                        &cmd->buffer[i],
                                                        data_len);
      i += data_len;

      if (st != EMBER_ZCL_STATUS_SUCCESS) {
        all_success = false;
        // Per ZCL write response format: include attr id for failures
        (void)emberAfPutInt8uInResp((uint8_t)st);
        (void)emberAfPutInt16uInResp(attribute_id);
      }
    }

    if (all_success) {
      // For all-success case, emit single success status.
      (void)emberAfPutInt8uInResp((uint8_t)EMBER_ZCL_STATUS_SUCCESS);
    }

    EmberStatus send_st = emberAfSendResponse();
    if (send_st != EMBER_SUCCESS) {
      APP_DEBUG_PRINTF("MFG WRITE response send failed: 0x%02x\n", send_st);
    }
    return true;
  }

