faronov/efr32mg1p-zigbee-sensor/app.c
  return false;
}

bool emberAfPreCommandReceivedCallback(EmberAfClusterCommand *cmd)
{
  if (app_handle_basic_mfg_rw_command(cmd)) {
    return true;
  }

  if (cmd != NULL && cmd->mfgSpecific == 0u) {
    if (cmd->commandId == ZCL_CONFIGURE_REPORTING_COMMAND_ID
        || cmd->commandId == ZCL_READ_REPORTING_CONFIGURATION_COMMAND_ID) {
      APP_DEBUG_PRINTF("ZCL cfg-report rx: ep=%u clus=0x%04x cmd=0x%02x dir=%u len=%u\n",
                       cmd->apsFrame->destinationEndpoint,
                       cmd->apsFrame->clusterId,
                       cmd->commandId,
                       (unsigned)((cmd->buffer[0] & ZCL_FRAME_CONTROL_CLIENT_TO_SERVER) ? 1 : 0),
                       cmd->bufLen);
      if (cmd->bufLen >= 6) {
        uint8_t dir = cmd->buffer[3];
        EmberAfAttributeId attr = (EmberAfAttributeId)(cmd->buffer[4] | ((uint16_t)cmd->buffer[5] << 8));
        APP_DEBUG_PRINTF("ZCL cfg-report attr: dir=%u attr=0x%04x\n", dir, attr);
      }
      if (cmd->commandId == ZCL_CONFIGURE_REPORTING_COMMAND_ID) {
        uint16_t i = 3;
        while ((i + 5u) < cmd->bufLen) {
          uint8_t dir = cmd->buffer[i++];
          EmberAfAttributeId attr = (EmberAfAttributeId)(cmd->buffer[i] | ((uint16_t)cmd->buffer[i + 1] << 8));
          i += 2;
          if (dir == EMBER_ZCL_REPORTING_DIRECTION_REPORTED) {
            if ((i + 5u) > cmd->bufLen) {
              break;
            }
            uint8_t type = cmd->buffer[i++];
            uint16_t min_i = (uint16_t)(cmd->buffer[i] | ((uint16_t)cmd->buffer[i + 1] << 8));
            i += 2;
            uint16_t max_i = (uint16_t)(cmd->buffer[i] | ((uint16_t)cmd->buffer[i + 1] << 8));
            i += 2;
            uint32_t change = 0;
            uint8_t change_len = emberAfGetDataSize(type);
            if ((i + change_len) > cmd->bufLen) {
              break;
            }
            for (uint8_t n = 0; n < change_len; n++) {
              change |= ((uint32_t)cmd->buffer[i + n]) << (8u * n);
            }
            i += change_len;
            APP_DEBUG_PRINTF("ZCL cfg-report set: clus=0x%04x attr=0x%04x type=0x%02x min=%us max=%us chg=%lu\n",
                             cmd->apsFrame->clusterId,
                             attr,
                             type,
                             (unsigned)min_i,
                             (unsigned)max_i,
                             (unsigned long)change);
          } else {
            if ((i + 2u) > cmd->bufLen) {
              break;
            }
            uint16_t timeout = (uint16_t)(cmd->buffer[i] | ((uint16_t)cmd->buffer[i + 1] << 8));
            i += 2;
            APP_DEBUG_PRINTF("ZCL cfg-report recv: clus=0x%04x attr=0x%04x timeout=%us\n",
                             cmd->apsFrame->clusterId,
                             attr,
                             (unsigned)timeout);
          }
        }
      }
    }
  }
  return false;
}

/**
 * @brief Button press callback
 *
 * Called when a button is pressed or released on the board.
 * Detects short press (<5s) vs long press (>=5s).
 *
 * CRITICAL: This runs in ISR context (GPIO_ODD_IRQn)!
 * CANNOT call ANY functions that interact with Zigbee stack!
 * CANNOT call emberAfCorePrintln()!
 * CANNOT call sl_zigbee_event_set_active()!
 *
 * Only allowed: read hardware, do math, set volatile flags
 * The button_poll_event running in main context will check these flags
 */
#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
void sl_button_on_change(const sl_button_t *handle)
{
  if (handle == &sl_button_btn0) {
    if (network_join_in_progress) {
      button_short_press_pending = false;
      button_long_press_pending = false;
      button_pressed = false;
      button_press_start_tick = 0;
      return;
    }

    if (app_button_unlock_tick != 0) {
      uint32_t now = sl_sleeptimer_get_tick_count();
      if ((int32_t)(app_button_unlock_tick - now) > 0) {
        button_pressed = false;
        button_press_start_tick = 0;
        return;
      }
      app_button_unlock_tick = 0;
    }

    // Ignore button edges before AF init to avoid stale hold-duration math.
    if (!af_init_seen) {
      button_pressed = false;
      button_press_start_tick = 0;
      return;
    }

    if (sl_button_get_state(handle) == SL_SIMPLE_BUTTON_PRESSED) {
      if (button_pressed) {
        return;
      }
      // Button pressed - record start time
      button_press_start_tick = sl_sleeptimer_get_tick_count();
      button_pressed = true;
      APP_DEBUG_PRINTF("BTN0: PRESSED\n");
    } else {
      // Button released - check duration
      if (button_pressed) {
        uint32_t duration_ticks = sl_sleeptimer_get_tick_count() - button_press_start_tick;
        uint32_t duration_ms = sl_sleeptimer_tick_to_ms(duration_ticks);
        APP_DEBUG_PRINTF("BTN0: RELEASED (%lu ms)\n", (unsigned long)duration_ms);

        if (duration_ms > APP_DEBUG_BUTTON_MAX_VALID_PRESS_MS) {
          // Treat extremely long holds as floating-line glitches.
          button_pressed = false;
          return;
        }

        // Set flags for main context to poll
        // These will be checked by button_poll_event_handler()
        if (duration_ms >= BUTTON_DEBOUNCE_MS) {
          if (duration_ms >= APP_BUTTON_LONG_PRESS_MS) {
            button_long_press_pending = true;
          } else {
            button_short_press_pending = true;
          }
        }

        button_pressed = false;
      }
    }
  }
}
#endif

/**
 * @brief LED blink event handler
 *
 * Blinks the LED while joining network.
 */
static void led_blink_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  if (led_blink_active) {
    sl_led_toggle(&sl_led_led0);
    // Blink every 500ms
    sl_zigbee_event_set_delay_ms(&led_blink_event, 500);
  }
#endif
}

/**
 * @brief LED off event handler
 *
 * Turns off the LED after network join confirmation to save power.
 */
static void led_off_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  sl_led_turn_off(&sl_led_led0);
  emberAfCorePrintln("LED turned off to save power");
#endif
}

/**
 * @brief Main tick callback - runs every main loop iteration
 *
 * This is called from main context and is perfect for checking button flags
 * set by the button ISR. No event scheduling needed!
 */
void emberAfTickCallback(void)
{
  // In debug profiles, app_debug_poll() is called from main loop.
  // Avoid handling button/join logic in two places to prevent edge races.
#if !(APP_DEBUG_DIAG_ALWAYS || APP_DEBUG_FORCE_AF_INIT)
  app_debug_poll();
#endif
}

/**
 * @brief Optimized rejoin retry event handler
 *
 * Manages the rejoin state machine:
 * 1. Try current channel first (fast path)
 * 2. If timeout, try all channels (fallback)
 */
static void rejoin_retry_event_handler(sl_zigbee_event_t *event)
{
  // TEMPORARILY DISABLED - event queue issue
  // Optimized rejoin functionality removed to reduce event usage
  (void)event;  // Unused parameter
}

/**
 * @brief Start optimized rejoin - try current channel first
 *
 * Optimization: Attempt rejoin on previously-used channel first for fast
 * reconnection (~138ms vs ~2.2s). Falls back to full channel scan after
 * timeout if current channel doesn't respond.
 *
 * Benefits:
 * - 7x faster rejoin when successful (typical case)
 * - ~85% power savings for successful rejoins
 * - Graceful fallback to full scan if network changed
 */
static void start_optimized_rejoin(void)
{
  // TEMPORARILY DISABLED - event queue issue
  // Optimized rejoin functionality removed to reduce event usage
}

/**
 * @brief Try next channel in the scan sequence
 *
 * Move to next channel and attempt join. If all channels exhausted,
 * report failure and stop scanning.
 */
static void try_next_channel(void)
{
  const uint8_t total_channels = sizeof(channel_scan_order) / sizeof(channel_scan_order[0]);

