faronov/efr32mg1p-zigbee-sensor/app.c
  if (join_scan_in_progress) {
    APP_DEBUG_PRINTF("Join: scan already in progress\n");
    return;
  }

  // Move to next channel
  current_channel_index++;

  while (current_channel_index < total_channels) {
    EmberStatus status = start_join_scan();
    if (status == EMBER_SUCCESS) {
      return;
    }
    APP_DEBUG_PRINTF("Join: scan start failed on ch %d status 0x%02x\n",
                     channel_scan_order[current_channel_index],
                     status);
    current_channel_index++;
  }

  if (current_channel_index >= total_channels) {
    // Exhausted all channels - give up
    emberAfCorePrintln("All channels scanned - no network found");
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;
    current_channel_index = 0;
    join_attempt_count++;

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Stop LED blinking
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);
    sl_led_turn_off(&sl_led_led0);
#endif
  }
}

/**
 * @brief Start an active scan on the current channel
 *
 * Series 1 Workaround: Scans ONE channel at a time instead of all 16 channels
 * simultaneously. This prevents event queue overflow on Series 1 chips.
 */
static EmberStatus start_join_scan(void)
{
  const uint8_t total_channels = sizeof(channel_scan_order) / sizeof(channel_scan_order[0]);

  if (current_channel_index >= total_channels) {
    emberAfCorePrintln("ERROR: Invalid channel index %d", current_channel_index);
    return EMBER_INVALID_CALL;
  }

  uint8_t channel_to_scan = channel_scan_order[current_channel_index];
  uint32_t single_channel_mask = BIT32(channel_to_scan);

  emberAfCorePrintln("Active scan channel %d (%d of %d)...",
                     channel_to_scan,
                     current_channel_index + 1,
                     total_channels);
  APP_DEBUG_PRINTF("Join: start scan channel %d mask 0x%08lx\n",
                   channel_to_scan,
                   (unsigned long)single_channel_mask);

  join_scan_in_progress = true;
  join_network_found = false;
  memset(&join_candidate, 0, sizeof(join_candidate));

  // Scan ONLY this one channel - uses minimal events
  EmberStatus status = emberStartScan(EMBER_ACTIVE_SCAN, single_channel_mask, JOIN_SCAN_DURATION);
  APP_DEBUG_PRINTF("Join: emberStartScan -> 0x%02x\n", status);

  if (status != EMBER_SUCCESS) {
    emberAfCorePrintln("Failed to start scan on channel %d: 0x%x", channel_to_scan, status);
    join_scan_in_progress = false;
  }

  return status;
}

/**
 * @brief Scan result callback (called for each network found)
 */
void emberAfNetworkFoundCallback(EmberZigbeeNetwork *networkFound, uint8_t lqi, int8_t rssi)
{
#if APP_RUNTIME_NETWORK_STEERING
  // Network Steering plugin owns scan callbacks when present.
  (void)networkFound;
  (void)lqi;
  (void)rssi;
  return;
#else
  if (!network_join_in_progress || networkFound == NULL) {
    return;
  }

  if (!networkFound->allowingJoin) {
    APP_DEBUG_PRINTF("Join: network ch %d pan 0x%04x not open (lqi=%u rssi=%d)\n",
                     networkFound->channel,
                     networkFound->panId,
                     lqi,
                     rssi);
    return;
  }

  if (!join_network_found) {
    join_network_found = true;
    join_candidate = *networkFound;
    APP_DEBUG_PRINTF("Join: found network ch %d pan 0x%04x (lqi=%u rssi=%d)\n",
                     join_candidate.channel,
                     join_candidate.panId,
                     lqi,
                     rssi);
  }
#endif
}

/**
 * @brief Scan completion callback
 */
void emberAfScanCompleteCallback(uint8_t channel, EmberStatus status)
{
#if APP_RUNTIME_NETWORK_STEERING
  // Network Steering plugin owns scan callbacks when present.
  (void)channel;
  (void)status;
  return;
#else
  if (!network_join_in_progress) {
    return;
  }

  join_scan_in_progress = false;
  APP_DEBUG_PRINTF("Join: scan complete ch=%u status=0x%02x found=%d\n",
                   channel,
                   status,
                   join_network_found ? 1 : 0);

  if (join_network_found) {
    if (!configure_join_security()) {
      emberAfCorePrintln("Join aborted: security state setup failed");
      APP_DEBUG_PRINTF("Join: abort scan result join due to security setup failure\n");
      network_join_in_progress = false;
      join_scan_in_progress = false;
      join_network_found = false;
      current_channel_index = 0;
      return;
    }

    EmberNetworkParameters params;
    memset(&params, 0, sizeof(params));
    memcpy(params.extendedPanId, join_candidate.extendedPanId, EXTENDED_PAN_ID_SIZE);
    params.panId = join_candidate.panId;
    params.radioChannel = join_candidate.channel;
    params.radioTxPower = emberGetRadioPower();
    params.joinMethod = EMBER_USE_MAC_ASSOCIATION;
    params.nwkManagerId = 0x0000;
    params.nwkUpdateId = join_candidate.nwkUpdateId;
    params.channels = BIT32(join_candidate.channel);

    EmberNodeType node_type = APP_DEBUG_JOIN_AS_END_DEVICE ? EMBER_END_DEVICE : EMBER_SLEEPY_END_DEVICE;
    APP_DEBUG_PRINTF("Join: node type=%s\n",
                     APP_DEBUG_JOIN_AS_END_DEVICE ? "END_DEVICE" : "SLEEPY_END_DEVICE");
    EmberStatus join_status = emberJoinNetwork(node_type, &params);
    APP_DEBUG_PRINTF("Join: emberJoinNetwork -> 0x%02x\n", join_status);
    if (join_status != EMBER_SUCCESS) {
      emberAfCorePrintln("Join failed to start: 0x%x", join_status);
      // If stack is busy/not ready, channel hopping does not help and causes long loops.
      // Abort this join attempt and wait for the next user press.
      EmberNetworkStatus net_state = emberAfNetworkState();
      APP_DEBUG_PRINTF("Join: abort attempt on status 0x%02x (net=%d)\n", join_status, net_state);
      network_join_in_progress = false;
      join_scan_in_progress = false;
      join_network_found = false;
      current_channel_index = 0;
      join_security_configured = false;
      app_set_join_retry_backoff(sl_sleeptimer_get_tick_count(), APP_DEBUG_JOIN_RETRY_BACKOFF_MS);
      }
    return;
  }

