faronov/efr32mg1p-zigbee-sensor/app.c
  // No joinable network on this channel - try next channel
  try_next_channel();
#endif
}

/**
 * @brief Handle short button press (<5 seconds)
 *
 * Short press triggers immediate sensor read and report.
 * If not joined to network, starts network joining.
 */
static void handle_short_press(void)
{
#if APP_DEBUG_SPI_ONLY
  app_flash_probe();
  return;
#endif
  EmberNetworkStatus network_state = emberAfNetworkState();

  if (network_state == EMBER_JOINED_NETWORK) {
    // Already on network - trigger immediate sensor reading
    emberAfCorePrintln("Triggering immediate sensor read...");
    app_sensor_update();

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Flash LED briefly to indicate sensor read
    sl_led_turn_on(&sl_led_led0);
    sl_sleeptimer_delay_millisecond(200);
    sl_led_turn_off(&sl_led_led0);
#endif

  } else {
    uint32_t now = sl_sleeptimer_get_tick_count();
    if (app_join_retry_blocked(now)) {
      APP_DEBUG_PRINTF("Join: retry backoff active\n");
      return;
    }
    if (!af_init_seen) {
      APP_DEBUG_PRINTF("Join: AF init not ready - deferring\n");
      join_pending = true;
      return;
    }
    if (network_join_in_progress) {
      emberAfCorePrintln("Join already in progress - ignoring button press");
      APP_DEBUG_PRINTF("Join: already in progress\n");
      return;
    }

    // Not on network - start join
    emberAfCorePrintln("Not joined - starting network join (attempt %d)...",
                       join_attempt_count + 1);
    APP_DEBUG_PRINTF("Join: attempt %d\n", join_attempt_count + 1);
#if !APP_RUNTIME_NETWORK_STEERING
    if (!configure_join_security()) {
      emberAfCorePrintln("Join aborted: security state setup failed");
      return;
    }
#endif

    // Reset to start of channel list
    current_channel_index = 0;
    join_scan_in_progress = false;
    join_network_found = false;
    network_join_in_progress = true;

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Start LED blinking to indicate joining
    led_blink_active = true;
    sl_zigbee_event_set_active(&led_blink_event);
#endif

    EmberStatus join_status = EMBER_INVALID_CALL;
#if APP_RUNTIME_NETWORK_STEERING
    // When network steering is linked, use only plugin API to avoid scan callback conflicts.
    // Keep post-join behavior quiet and deterministic:
    // - skip steering-driven TC link key update workflow
    // - keep join focused on association/interview
    sli_zigbee_af_network_steering_options_mask = EMBER_AF_PLUGIN_NETWORK_STEERING_OPTIONS_NO_TCLK_UPDATE;
    join_status = emberAfPluginNetworkSteeringStart();
    APP_DEBUG_PRINTF("Join: emberAfPluginNetworkSteeringStart -> 0x%02x\n", join_status);
#else
    // Manual active scan + join path for builds without network steering plugin.
    join_status = start_join_scan();
#endif

    if (join_status != EMBER_SUCCESS) {
      emberAfCorePrintln("Join failed to start: 0x%x", join_status);
      if (join_status == EMBER_INVALID_CALL || join_status == 0xA8) {
        emberAfCorePrintln("Join aborted: stack not ready");
        network_join_in_progress = false;
        join_scan_in_progress = false;
        join_network_found = false;
        join_security_configured = false;
        app_set_join_retry_backoff(sl_sleeptimer_get_tick_count(), APP_DEBUG_JOIN_RETRY_BACKOFF_MS);
      } else {
        try_next_channel();
      }

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
      // Stop LED blinking on failure
      if (!network_join_in_progress) {
        led_blink_active = false;
        sl_zigbee_event_set_inactive(&led_blink_event);
        sl_led_turn_off(&sl_led_led0);
      }
#endif
    }
  }
}

static bool configure_join_security(void)
{
  EmberInitialSecurityState state;
  memset(&state, 0, sizeof(state));
  memcpy(state.preconfiguredKey.contents, zigbee_alliance_key, EMBER_ENCRYPTION_KEY_SIZE);
  state.bitmask = (EMBER_HAVE_PRECONFIGURED_KEY
                   | EMBER_REQUIRE_ENCRYPTED_KEY
                   | EMBER_TRUST_CENTER_GLOBAL_LINK_KEY);

  EmberStatus st = emberSetInitialSecurityState(&state);
  APP_DEBUG_PRINTF("Join: set security state -> 0x%02x\n", st);
  join_security_configured = (st == EMBER_SUCCESS);
  return join_security_configured;
}

/**
 * @brief Handle long button press (>=5 seconds)
 *
 * Long press toggles network state:
 * - joined: leave network
 * - not joined: start join
 */
static void handle_long_press(void)
{
  EmberNetworkStatus network_state = emberAfNetworkState();

  if (network_state == EMBER_JOINED_NETWORK) {
    emberAfCorePrintln("Long press: leaving network...");
    app_intentional_leave_pending = true;
    button_short_press_pending = false;
    button_long_press_pending = false;
    button_pressed = false;
    button_press_start_tick = 0;

    // Leave the network
    EmberStatus leave_status = emberLeaveNetwork();
    if (leave_status == EMBER_SUCCESS) {
      emberAfCorePrintln("Leave requested, waiting for network down");
    } else {
      app_intentional_leave_pending = false;
      emberAfCorePrintln("Failed to leave network: 0x%x", leave_status);
    }
  } else {
    emberAfCorePrintln("Long press: not joined, starting join");
    handle_short_press();
  }
}
